{
  "architectures": [
    "Qwen2VLNaViT"
  ],
  "auto_map": {
    "AutoConfig": "configuration_qwen2vl_navit.Qwen2VLNaViTConfig",
    "AutoModel": "modeling_qwen2vl_navit.Qwen2VLNaViT"
  },
  "depth": 32,
  "hidden_act": "quick_gelu",
  "hidden_size": 1280,
  "in_channels": 3,
  "mlp_ratio": 4,
  "model_type": "qwen2vl_navit",
  "num_heads": 16,
  "patch_size": 14,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.47.1"
}
